(function (window) {
  'use strict';

  if (!window.flatpickr) {
    return;
  }

  window.flatpickr.l10ns.ar = {
    weekdays: {
    //   shorthand: ['أحد', 'إثنين', 'ثلاثاء', 'أربعاء', 'خميس', 'جمعة', 'سبت'],
      shorthand: ['الأحد', 'الاثنين', 'الثلاثاء', 'الأربعاء', 'الخميس', 'الجمعة', 'السبت'],
      longhand: ['الأحد', 'الاثنين', 'الثلاثاء', 'الأربعاء', 'الخميس', 'الجمعة', 'السبت']
    },
    months: {
      shorthand: ['يناير', 'فبراير', 'مارس', 'أبريل', 'مايو', 'يونيو', 'يوليو', 'أغسطس', 'سبتمبر', 'أكتوبر', 'نوفمبر', 'ديسمبر'],
      longhand: ['يناير', 'فبراير', 'مارس', 'أبريل', 'مايو', 'يونيو', 'يوليو', 'أغسطس', 'سبتمبر', 'أكتوبر', 'نوفمبر', 'ديسمبر']
    },
    firstDayOfWeek: 6,
    rangeSeparator: ' إلى ',
    weekAbbreviation: 'أسبوع',
    scrollTitle: 'مرر للزيادة',
    toggleTitle: 'اضغط للتبديل'
  };
})(window);
